<script setup lang="ts">

</script>

<template>
  <h1>О чем эта игра</h1>
  <p>
    Это стратегический ивент, в котором ты проходишь реальные видеоигры и за счет этого расширяешь влияние на общей
    карте.
    <br><br>
    Это игра для прохождения игр. Может быть ты просто хочешь весело провести с друзьями время. Может быть ты хочешь
    пройти какие-то игры, но тебе постоянно не хватает на них время. А может быть тебя позвал друг и ты не знаешь, что
    здесь делаешь.
    <br><br>
    Здесь ты будешь заниматься следующими вещами:
    <br>
    - Захватывать территории<br>
    - Получать очки<br>
    - Усиливать персонажа<br>
    - Влиять на ситуацию на карте<br>
    <br>
    Побеждает тот, кто к концу события наберет больше всех очков.
  </p>
  <h1>Как играть</h1>
  <p>
    В начале у тебя есть список игр, которые ты хочешь пройти. Одна из них случайно становится текущей и ты начинаешь
    ее проходить. Пока ты играешь, работает таймер. Каждые 2 часа ты получаешь игровые ресурсы.
    <br><br>
    Эти ресурсы позволяют тебе:
    <br>
    - Захватывать клетки на карте<br>
    - Получать случайные эффекты через колесо<br>
    - Развивать характеристики персонажа<br>
  </p>
  <h1>Что происходит на карте</h1>
  <p>
    У каждого игрока есть база и токен. Ты перемещаешься по своим территориям и постепенно захватываешь новые. Каждый
    захват приносит очки и запускает небольшое событие — квест. Чаще всего результат зависит от броска кубика и твоих
    характеристик.
  </p>
</template>

<style scoped>

</style>